In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
!type ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
df = pd.read_csv("ex1.csv")
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
string_data = pd.Series(["aardvark","artichoke",np.nan,"avocado"])
string_data.dropna()
#string_data

0     aardvark
1    artichoke
3      avocado
dtype: object

In [18]:
string_data[string_data.notnull()]

0     aardvark
1    artichoke
3      avocado
dtype: object

In [28]:
data = pd.DataFrame([[1,2,3.5,],
                 [1,np.nan,np.nan],
                 [np.nan,np.nan,np.nan],
                 [np.nan,6.5,3.]])
data.dropna()#删除含有nan的所有行
data.dropna(how="all")#删除所有值为nan的行
data[3]=np.nan
print(data)
data.dropna(axis=1,how="all")

     0    1    2   3
0  1.0  2.0  3.5 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  2.0  3.5
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [32]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:3,1:]=np.nan
df.dropna()

          0         1         2
3  0.651484  0.801459  0.558727
4  1.585856 -0.583338 -1.465337
5 -0.895003 -0.270179  0.454229
6 -0.357057  1.225649  0.813677

In [43]:
df = pd.DataFrame({"k1":["one","two"]*3,"k2":[1,2,3]*2})
df
#df.duplicated("k1")
df.drop_duplicates(["k1","k2"])

    k1  k2
0  one   1
1  two   2
2  one   3
3  two   1
4  one   2
5  two   3

In [45]:
#Series的map方法
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','nova lox'],
                    'ounces':[3,5,12,7.5]})
meat_to_animal = {'bacon':'pig','pulled pork':'pig','nova lox':'cow'}
lowercase = data['food'].str.lower()
data['animal'] = data['food'].map(meat_to_animal)

          food  ounces animal
0        bacon     3.0    pig
1  pulled pork     5.0    pig
2        bacon    12.0    pig
3     nova lox     7.5    cow

In [49]:
data['animal2'] = data['food'].map(lambda x: meat_to_animal[x])
data

          food  ounces animal animal2
0        bacon     3.0    pig     pig
1  pulled pork     5.0    pig     pig
2        bacon    12.0    pig     pig
3     nova lox     7.5    cow     cow

In [51]:
data = pd.Series([1,5.5,-999,-1000,45.6])
data.replace([-999,-1000],[np.nan,0])
data

0       1.0
1       5.5
2    -999.0
3   -1000.0
4      45.6
dtype: float64

In [55]:
data = pd.DataFrame(np.random.randint(0,100,size=(4,3)))

    0   1   2
0  60  77  42
1   0   6  98
2  72  96  85
3  17  62  43

In [57]:
data[0] = data[0].replace(0,100)
data

     0   1   2
0   60  77  42
1  100   6  98
2   72  96  85
3   17  62  43

In [61]:
#重命名轴索引
df = pd.DataFrame(np.arange(12).reshape(4,3),index=['as','bswq','casd','dswq'],columns=['qrfg','wdw','evc'])
df.index = df.index.map(lambda x: x.upper())
df

      qrfg  wdw  evc
AS       0    1    2
BSWQ     3    4    5
CASD     6    7    8
DSWQ     9   10   11

In [67]:
df.rename(index=str.title,columns=str.upper,inplace=True)
df

      QRFG  WDW  EVC
As       0    1    2
Bswq     3    4    5
Casd     6    7    8
Dswq     9   10   11

In [79]:
#离散化和分箱
data = {'name':['a','b','c','d','e','f','g','h'],'age':[12,34,56,45,38,23,25,14]}
df = pd.DataFrame(data,columns=['name','age'])
bins=[10,18,40,60]
df['ages'] = pd.cut(df.age,bins,labels=[0,1,2])
df

  name  age ages
0    a   12    0
1    b   34    1
2    c   56    2
3    d   45    2
4    e   38    1
5    f   23    1
6    g   25    1
7    h   14    0

In [106]:
#检测和过滤异常值
data = pd.DataFrame(np.random.randn(100,4))
data[(data>4).any(0)]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  This is separate from the ipykernel package so we can avoid doing imports until

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match